CSI API ETABS v1
cCaseStaticNonlinearStaged.SetSolControlParameters Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSolControlParameters(
	string Name,
	int MaxTotalSteps,
	int MaxFailedSubSteps,
	int MaxIterCS,
	int MaxIterNR,
	double TolConvD,
	bool UseEventStepping,
	double TolEventD,
	int MaxLineSearchPerIter,
	double TolLineSearch,
	double LineSearchStepFact
)
Function SetSolControlParameters (
	Name As String,
	MaxTotalSteps As Integer,
	MaxFailedSubSteps As Integer,
	MaxIterCS As Integer,
	MaxIterNR As Integer,
	TolConvD As Double,
	UseEventStepping As Boolean,
	TolEventD As Double,
	MaxLineSearchPerIter As Integer,
	TolLineSearch As Double,
	LineSearchStepFact As Double
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim MaxTotalSteps As Integer
Dim MaxFailedSubSteps As Integer
Dim MaxIterCS As Integer
Dim MaxIterNR As Integer
Dim TolConvD As Double
Dim UseEventStepping As Boolean
Dim TolEventD As Double
Dim MaxLineSearchPerIter As Integer
Dim TolLineSearch As Double
Dim LineSearchStepFact As Double
Dim returnValue As Integer
returnValue = instance.SetSolControlParameters(Name,
	MaxTotalSteps, MaxFailedSubSteps,
	MaxIterCS, MaxIterNR, TolConvD, UseEventStepping,
	TolEventD, MaxLineSearchPerIter,
	TolLineSearch, LineSearchStepFact)
int SetSolControlParameters(
	String^ Name,
	int MaxTotalSteps,
	int MaxFailedSubSteps,
	int MaxIterCS,
	int MaxIterNR,
	double TolConvD,
	bool UseEventStepping,
	double TolEventD,
	int MaxLineSearchPerIter,
	double TolLineSearch,
	double LineSearchStepFact
)
abstract SetSolControlParameters :
        Name : string *
        MaxTotalSteps : int *
        MaxFailedSubSteps : int *
        MaxIterCS : int *
        MaxIterNR : int *
        TolConvD : float *
        UseEventStepping : bool *
        TolEventD : float *
        MaxLineSearchPerIter : int *
        TolLineSearch : float *
        LineSearchStepFact : float -> int
Parameters
Name
Type: System.String
MaxTotalSteps
Type: System.Int32
MaxFailedSubSteps
Type: System.Int32
MaxIterCS
Type: System.Int32
MaxIterNR
Type: System.Int32
TolConvD
Type: System.Double
UseEventStepping
Type: System.Boolean
TolEventD
Type: System.Double
MaxLineSearchPerIter
Type: System.Int32
TolLineSearch
Type: System.Double
LineSearchStepFact
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace